{
	"HaloFrance": {
		"projectTitle": "Halo France",
		"projectSummary": "French website built to vote for Team Master Chief or Team Locke - Halo.",
		"thumbnail": "img/halo/thumbnail.png",
		"thumbnailAlt": "Screenshot Halo build",
		"projectURL": "HaloFrance",
		"projectImages": [
			"img/halo/hero-halo.png",
			"img/halo/prize-halo.png",
			"img/halo/results-halo.png",
			"img/halo/thumbnail-halo.png"
		],			
		"projectDetails": [
			"Concept: Create a fluidly responsive website, where users can vote for one of two Halo teams, review results from previous weeks' voting, and see which prize they could win for the current week voting.",
			"Approach: Starting from a desktop version of an Adobe Photoshop file (PSD), I developed a mobile-first, fluidly responsive layout. Mobile versions were designed by myself based on past experience and in collaboration with our design team. Animations were created using both CSS3 animations/transforms, as well as modular OOP JavaScript and jQuery conditional logic.",
			"Functionality: Based on the current week open to voting, the respective week's prize and voting content block were dynamically updated via JavaScript to allow users to interact with the page. On completion of a week's voting period, raw data for each Halo team, would be input into the application's JavaScript file.",
			"The application's JavaScript logic would auto calculate an estimated percentage (1% - 99%) for each team, then follow by showing the winning team's hero, and both team's results in order based on the results. The preceding and following week (if applicable) would dynamically update to their respective states."
		],
		"languages": ["HTML", "CSS (Sass, Compass)", "Javascript", "jQuery", "Gulp"],
		"websiteUrl": "http://review.tenguncreative.com/halo5_france"
	},

	"SurfaceHoliday": {
		"projectTitle": "Microsoft Surface Holiday Campaign",
		"projectSummary": "Product Detail Pages (PDP) built for Microsoft's Surface team for global distribution.",
		"thumbnail": "img/surface_holiday/thumb.png",
		"thumbnailAlt": "Screen shot of PDP builds",
		"projectURL": "SurfaceHoliday",
		"projectImages": [
			"img/surface_holiday/in-context.png",
			"img/surface_holiday/zzom1.png",
			"img/surface_holiday/zoom2.png",
			"img/surface_holiday/accessories.png"
		],
		"projectDetails": [
			"Concept: The Microsoft Surface Product Detail Pages (PDP) were a large set of individualized web pages, built for Microsoft's Surface 3, Surface 4, Surface Pro 4, Surface Book and 16 Surface related accessories. The majority of the PDPs had a similar layout, although each needed to have the ability to easily move content blocks, left-to-right configuration and other required features to full-fill each of the 22 separate builds. Further, each page needed to have a breakpoint responsive layout, and be able to be easily implemented in a very wide range of retailer websites globally distributed and widely varied in size (ex. Best Buy to a mom-and-pop).",
			"Approach: With a relatively short turn around time to complete each of the 22 separate builds, as well as to be able to fully-support multiple browsers, devices and as early as Internet Explorer 9, I took the approach to create a fully responsive and modular PDP template. This template allowed myself to meet the requirements of each build, and gave enough flexibility to turn on/off portions of each content block, as well as manipulate each as needed per the requirements.",
			"Functionality: Using a module Sass (CSS preprocessor) and OOP JavaScript and jQuery development style, I gave myself the ability to attach simple class names onto specific HTML elements and change those contents to fit the module required for the build. This development style, also permitted a constant outcome for each of the 22 builds in this project cycle, and continues to be our template of choice for PDPs with similar designs. The template helps in reducing needed QA testing as well as design and development costs.",
			"The PDP template is easily modifiable and has a relatively low level of ramp up time for other developers to utilize for future projects."
		],
		"languages": ["HTML", "CSS (Sass, Compass)", "Javascript", "jQuery", "Gulp"]
	},

	"MicrosoftReactor": {
		"projectTitle": "Microsoft Reactor",
		"projectSummary": "Customized WordPress site for Microsoft Reactor.",
		"thumbnail": "img/reactor/thumbnail.png",
		"thumbnailAlt": "Microsoft Reactor screenshot on Surface Book laptop",
		"projectURL": "MicrosoftReactor",
		"projectImages": [
			"img/reactor/hero.png",
			"img/reactor/wireframes-reactor.png",
			"img/reactor/home-reactor.png",
			"img/reactor/about-reactor.png",
			"img/reactor/events-reactor.png"
		],	
		"projectDetails": [
			"Concept: Microsoft Reactor is a new venture from Microsoft. The ideas is to create a place where startups and developers, can work together and have assistance from Microsoft staff on anything built with Microsoft's product line. Microsoft Reactor needed a simple website to be able to showcase their activities, while allowing participates to see where the office was and when events were being help.",
			"Approach: Utilizing Elegant Theme's Divi framework, I created a customized version that fulfilled the client's needs. I was able to hook into both native WordPress, Divi and another plugin's WordPress Hooks, allowing the ability to create a customized experience for the end user.",
			"Functionality: Both the front end, back end and administrative side were customed developed using a variety of CSS, WordPress funcations, hooks and filters, as well as modification of the PHP theme template. I was able to maintain the functionality and ease of use that WordPress and Divi provides, while providing a simple but robust build."
		],
		"languages": ["WordPress", "PHP", "CSS", "jQuery"],
		"websiteUrl": "http://MicrosoftReactor.com"
	},

	"QR_Generator": {
		"projectTitle": "QR Code Generator",
		"projectSummary": "QR Code Generator with integrated images, fully customized QR Code styling and raster image download.",
		"thumbnail": "img/qr_code/thumb.png",
		"thumbnailAlt": "Screen shot of QR Code Generator on a black Dell laptop.",
		"projectURL": "QR_Generator",
		"projectImages": [
			"img/qr_code/responsive.png"
		],
		"projectDetails": [
			"Concept: This project is a good example of implementation of a simple design and usability. The single page website, allowed users to generate QR codes with custom colors, text, shapes, and sizes, for download and use in web and print. It is primarily being used within Microsoft's marketing team for a variety of projects.",
			"Approach: Working closely with a digital designer, we started with the full list of possible tools that could be included, and then researched existing QR tools to determine what was helpful and what was unnecessary. We then created user flows that resulted in a simple 3 step process and expanded on them to create an even better user experience.",
			"Functionality: Taking the newly created design, I modified an existing SVG QR code base, added the ability to place customized copy, adjust sizing, place and modify colors and logos, and allow user download of the created QR code. Each of the HTML form elements were custom created to allow for ease of use by users, giving the user the ability to finely tune their end product. The project was then skinned and made responsive for three set device viewports."

		],
		"languages": ["PHP", "HTML", "CSS", "SVG", "Javascript"]
	},

	"MicrosoftVentures": {
		"projectTitle": "Microsoft Ventures",
		"projectSummary": "Customized CMS for Microsoft Ventures.",
		"thumbnail": "img/ventures/thumbnail.png",
		"thumbnailAlt": "Microsoft Ventures screenshot",
		"projectURL": "MicrosoftVentures",
		"projectImages": [
			"img/ventures/hero.png",
			"img/ventures/programs-ventures.png",
			"img/ventures/blog-ventures.png",
			"img/ventures/locations-ventures.png"
		],
		"projectDetails": [
			"Microsoft Ventures is a global, startup incubator. I was brought on midway through this project to assist in completion of the fully-customized CMS's front-end.",
			"While working closely with a team of designers, I assisted in creating a robust and mobile-friendly visual experience. I developed specific content modules/blocks as well as pages and portions of the site's navigation.",
			"During this project, I helped to implement a Version Control system and project flow, which helped in implementing each content module/block per design."
		],
		"languages": ["HTML", "CSS", "jQuery", "JavaScript"],
		"websiteUrl": "http://microsoftventures.com"
	},

	"Irishmen": {
		"projectTitle": "the Irishmen Pub",
		"projectSummary": "Customized WordPress site.",
		"thumbnail": "img/irishmen/thumb.png",
		"thumbnailAlt": "Screenshot of site",
		"projectURL": "Irishmen",
		"projectImages": [
			"img/irishmen/hero.png"
		],
		"projectDetails": [
			"As my first custom WordPress site, my first client and essentially my first professional build and design, this web project was a lot of fun and rewarding to complete.",
			"Having started from a static Twitter Bootstrap build, I migrated and integrated this site to work within WordPress for the client. Fully customized query loops, web templates and plug-in integrations were just a few of the exciting things that I got to grow and learn from."
		],
		"languages": ["WordPress", "Twitter Bootstrap", "PHP", "CSS", "jQuery"],
		"websiteUrl": "http://Irishmen.com"
	}
}

