{
	"HaloFrance": {
		"projectTitle": "Halo France",
		"projectSummary": "French website built to vote for Team Master Chief or Team Locke - Halo.",
		"thumbnail": "img/halo/thumbnail.png",
		"thumbnailAlt": "Screenshot Halo build",
		"projectURL": "HaloFrance",
		"projectImages": [
			"img/halo/hero-halo.png",
			"img/halo/prize-halo.png",
			"img/halo/results-halo.png",
			"img/halo/thumbnail-halo.png"
		],			
		"projectDetails": [
			"Problem to solve for:",
			"Starting from a mobile-first perspective, I was tasked to create a visual and interactive experience using only a desktop PSD as my guide. The concept of the site was to allow users to vote weekly for a specific Halo team that they'd prefer. The week's prize needed to current for users to view, and the results from the previous week needed to be shown. The build also had to be able to be dropped into the client's existing website as best as possible.",
			"Build solutions:",
			"Using a fluid grid system, I created the site by moving elements around for various viewports, allowing all users on as many devices as possible view and interact with the site.",
			"Each week of voting had three states: voting coming, voting active, and voting results. Based on the current week, the prize section was dynamically updated to reflect the current week's prize. Each state also has it's own set of dynamically updated content.",
			"Using Javascript and some math, I created the results sections. Raw results numbers are passed into the script , and an estimated percentage value was then calculated and displayed to users. The results were animated using Javascript and mimicked Halo's health bar filling up.",
			"This build used a module OOP Javascript approach, and it's CSS was built using Sass, Compass (Sass extension) and Gulp's automating tasks."
		],
		"languages": ["HTML", "CSS (Sass, Compass)", "Javascript", "jQuery", "Gulp"],
		"websiteUrl": "http://review.tenguncreative.com/halo5_france"
	},

	"MicrosoftReactor": {
		"projectTitle": "Microsoft Reactor",
		"projectSummary": "Customized WordPress site for Microsoft Reactor.",
		"thumbnail": "img/reactor/thumbnail.png",
		"thumbnailAlt": "Microsoft Reactor screenshot on Surface Book laptop",
		"projectURL": "MicrosoftReactor",
		"projectImages": [
			"img/reactor/hero.png",
			"img/reactor/wireframes-reactor.png",
			"img/reactor/home-reactor.png",
			"img/reactor/about-reactor.png",
			"img/reactor/events-reactor.png"
		],	
		"projectDetails": [
			"Microsoft Reactor is a new venture from Microsoft which helps to facilitate startup growth using Microsoft's Azure development platform. This space is a modern and open place located in San Francisco where individuals or teams, can grab coffee, meet, work on their projects and get in-person answers regarding Microsoft Azure services - at no cost.",
			"The website was built with the WordPress CMS. A custom events' loop, content modules/blades and other features were integrated into Divi's WordPress theme, allowing for a fast, robust and complete build.",
			"I was tasked with building completed site, modifying the event plugin to full-fill design and functionality, as well as setting up the web environment."
		],
		"languages": ["WordPress", "PHP", "CSS", "jQuery"],
		"websiteUrl": "http://MicrosoftReactor.com"
	},

	"QR_Generator": {
		"projectTitle": "QR Code Generator",
		"projectSummary": "QR Code Generator with integrated images, fully customized QR Code styling and raster image download.",
		"thumbnail": "img/qr_code/thumb.png",
		"thumbnailAlt": "Screen shot of QR Code Generator on a black Dell laptop.",
		"projectURL": "QR_Generator",
		"projectImages": [
			"img/qr_code/responsive.png"
		],
		"projectDetails": [
			"This project is a good example of implementation of a simple design and usability. The single page website, allowed users to generate QR codes with custom colors, text, shapes, and sizes, for download and use in web and print.",
			"Working closely with a digital designer, we started with the full list of possible tools that could be included, and then researched existing QR tools to determine what was helpful and what was unnecessary. We then created user flows that resulted in a simple 3 step process.",
			"Taking the newly create design, I modified a small SVG QR code base, adding the ability to place customized copy, sizing and other features utilizing HTML form elements. The project was then skinned and made responsive for three set devices."

		],
		"languages": ["PHP", "HTML", "CSS", "SVG", "Javascript"]
	},

	"MicrosoftVentures": {
		"projectTitle": "Microsoft Ventures",
		"projectSummary": "Customized CMS for Microsoft Ventures.",
		"thumbnail": "img/ventures/thumbnail.png",
		"thumbnailAlt": "Microsoft Ventures screenshot",
		"projectURL": "MicrosoftVentures",
		"projectImages": [
			"img/ventures/hero.png",
			"img/ventures/programs-ventures.png",
			"img/ventures/blog-ventures.png",
			"img/ventures/locations-ventures.png"
		],
		"projectDetails": [
			"Microsoft Ventures is a global, startup incubator. I was brought on midway through this project to assist in completion of the fully-customized CMS's front-end.",
			"While working closely with a team of designers, I assisted in creating a robust and mobile-friendly visual experience. I developed specific content modules/blocks as well as pages and portions of the site's navigation.",
			"During this project, I helped to implement a Version Control system and project flow, which helped in implementing each content module/block per design."
		],
		"languages": ["HTML", "CSS", "jQuery"],
		"websiteUrl": "http://microsoftventures.com"
	},

	"Irishmen": {
		"projectTitle": "the Irishmen Pub",
		"projectSummary": "Customized WordPress site.",
		"thumbnail": "img/irishmen/thumb.png",
		"thumbnailAlt": "Screenshot of site",
		"projectURL": "Irishmen",
		"projectImages": [
			"img/irishmen/hero.png"
		],
		"projectDetails": [
			"As my first custom WordPress site, my first client and essentially my first professional build and design, this web project was a lot of fun and rewarding to complete.",
			"Having started from a static Twitter Bootstrap build, I migrated and integrated this site to work within WordPress for the client. Fully customized query loops, web templates and plug-in integrations were just a few of the exciting things that I got to grow and learn from."
		],
		"languages": ["WordPress", "PHP", "CSS", "jQuery"],
		"websiteUrl": "http://Irishmen.com"
	}
}

